meshtastic/Adafruit_nRF52_Bootloader_OTAFIX/src/usb/msc_uf2.c
/*
 * The MIT License (MIT)
 *
 * Copyright (c) 2018 Ha Thach for Adafruit Industries
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

#include "tusb.h"
#include "uf2/uf2.h"

#if CFG_TUD_MSC

#include "bootloader.h"
#include "nrfx_nvmc.h"
#include "app_timer.h"

/*------------------------------------------------------------------*/
/* MACRO TYPEDEF CONSTANT ENUM
 *------------------------------------------------------------------*/

/*------------------------------------------------------------------*/
/* UF2
 *------------------------------------------------------------------*/
static WriteState _wr_state = { 0 };

// Factory erase has run; the reset into UF2 mode is pending. Deferred so the
// host's trailing FAT/directory writes are still acked (they hit a device
// that is already gone otherwise), then main.c resets after usb_teardown().
static bool _factory_erase_done = false;
APP_TIMER_DEF(_factory_erase_timer);

// Window in which the host can finish its writes or eject before we reset.
// The RP2040 bootrom waits 1000 ms after the last block for the same reason.
#define FACTORY_ERASE_RESET_DELAY_MS   500

bool msc_factory_erase_pending(void)
{
  return _factory_erase_done;
}

// Leave the DFU event loop; check_dfu_mode() tears USB down and resets.
static void factory_erase_reset_now(void)
{
  dfu_update_status_t update_status;
  memset(&update_status, 0, sizeof(dfu_update_status_t));
  update_status.status_code = DFU_RESET;
  bootloader_dfu_update_process(update_status);
}

static void factory_erase_timer_handler(void *p_context)
{
  (void) p_context;
  factory_erase_reset_now();
}

void read_block(uint32_t block_no, uint8_t *data);
int  write_block(uint32_t block_no, uint8_t *data, WriteState *state);

//--------------------------------------------------------------------+
// tinyusb callbacks
//--------------------------------------------------------------------+

// Invoked when received SCSI_CMD_INQUIRY
// Application fill vendor id, product id and revision with string up to 8, 16, 4 characters respectively
void tud_msc_inquiry_cb(uint8_t lun, uint8_t vendor_id[8], uint8_t product_id[16], uint8_t product_rev[4])
{
  (void) lun;

  const char vid[] = "Adafruit";
  const char pid[] = "nRF UF2";
  const char rev[] = "1.0";

  memcpy(vendor_id  , vid, strlen(vid));
  memcpy(product_id , pid, strlen(pid));
  memcpy(product_rev, rev, strlen(rev));
}

// Invoked when received Test Unit Ready command.
// return true allowing host to read/write this LUN e.g SD card inserted
bool tud_msc_test_unit_ready_cb(uint8_t lun)
{
  (void) lun;
  return true;
}

// Callback invoked when received an SCSI command not in built-in list below
// - READ_CAPACITY10, READ_FORMAT_CAPACITY, INQUIRY, MODE_SENSE6, REQUEST_SENSE
// - READ10 and WRITE10 has their own callbacks
int32_t tud_msc_scsi_cb (uint8_t lun, uint8_t const scsi_cmd[16], void* buffer, uint16_t bufsize)
{
  void const* response = NULL;
  uint16_t resplen = 0;

  // most scsi handled is input
  bool in_xfer = true;

  switch (scsi_cmd[0])
  {
    case SCSI_CMD_PREVENT_ALLOW_MEDIUM_REMOVAL:
      // Host is about to read/write etc ... better not to disconnect disk
      resplen = 0;
    break;

    default:
      // Set Sense = Invalid Command Operation
      tud_msc_set_sense(lun, SCSI_SENSE_ILLEGAL_REQUEST, 0x20, 0x00);

      // negative means error -> tinyusb could stall and/or response with failed status
      resplen = -1;
    break;
  }

  // return resplen must not larger than bufsize
  if ( resplen > bufsize ) resplen = bufsize;

  if ( response && (resplen > 0) )
  {
    if(in_xfer)
    {
      memcpy(buffer, response, resplen);
    }else
    {
      // SCSI output
    }
  }

  return resplen;
}

// Callback invoked when received READ10 command.
// Copy disk's data to buffer (up to bufsize) and return number of copied bytes.
int32_t tud_msc_read10_cb (uint8_t lun, uint32_t lba, uint32_t offset, void* buffer, uint32_t bufsize)
{
  (void) lun;
  memset(buffer, 0, bufsize);

  // since we return block size each, offset should always be zero
  TU_ASSERT(offset == 0, -1);

  uint32_t count = 0;

  while ( count < bufsize )
  {
    read_block(lba, buffer);

    lba++;
    buffer += 512;
    count  += 512;
  }

  return count;
}

// Callback invoked when received WRITE10 command.
// Process data in buffer to disk's storage and return number of written bytes
int32_t tud_msc_write10_cb (uint8_t lun, uint32_t lba, uint32_t offset, uint8_t* buffer, uint32_t bufsize)
{
  (void) lun;

  uint32_t count = 0;
  while ( count < bufsize )
  {
    // Consider non-uf2 block write as successful
    // only break if write_block is busy with flashing (return 0)
    if ( 0 == write_block(lba, buffer, &_wr_state) ) break;

    lba++;
    buffer += 512;
    count  += 512;
  }

  return count;
}

// Callback invoked when WRITE10 command is completed (status received and accepted by host).
void tud_msc_write10_complete_cb(uint8_t lun)
{
  static bool first_write = true;

  // abort the DFU, uf2 block failed integrity check
  if ( _wr_state.aborted )
  {
    // aborted and reset
    PRINTF("Aborted\r\n");

    dfu_update_status_t update_status;
    memset(&update_status, 0, sizeof(dfu_update_status_t ));
    update_status.status_code = DFU_RESET;

    bootloader_dfu_update_process(update_status);

    led_state(STATE_WRITING_FINISHED);
  }
  else if ( _wr_state.factory_erase )
  {
    // Factory erase: wipe the whole App Data reservation. On nRF52840 that is
    // 10 pages: LittleFS (config, keys, bonds) in the top 7 at 0xED000, and
    // firmware's WarmNodeStore node-DB ring in the 3 below it at 0xEA000.
    // Erase the bootloader's own bound, never a filesystem size - shrinking
    // this loop to the LittleFS pages would leave a stale node DB behind.
    // The application code and bootloader settings are left alone, so a
    // device unplugged here boots its app factory-fresh; otherwise it comes
    // back as a UF2 drive ready for a firmware install, as the old erase
    // sketch did. Runs here, not in write_block, so the host has already
    // acked the write.
    PRINTF("Factory erase: App Data 0x%08lX-0x%08lX\r\n", (uint32_t) USER_FLASH_END, (uint32_t) BOOTLOADER_REGION_START);
    led_state(STATE_WRITING_STARTED);

    for ( uint32_t addr = USER_FLASH_END; addr < BOOTLOADER_REGION_START; addr += CODE_PAGE_SIZE )
    {
      nrfx_nvmc_page_erase(addr);
    }

    led_state(STATE_WRITING_FINISHED);

    // The host's follow-up FAT/directory writes complete through this callback
    // too: forget the erase block entirely, or the numBlocks branch below would
    // treat "1 of 1 written" as a finished app update and zero bank_0_size.
    memset(&_wr_state, 0, sizeof(_wr_state));
    _factory_erase_done = true;
    app_timer_create(&_factory_erase_timer, APP_TIMER_MODE_SINGLE_SHOT, factory_erase_timer_handler);
    app_timer_start(_factory_erase_timer, APP_TIMER_TICKS(FACTORY_ERASE_RESET_DELAY_MS), NULL);
  }
  else if ( _wr_state.numBlocks )
  {
    // Start LED writing pattern with first write
    if (first_write)
    {
      first_write = false;
      led_state(STATE_WRITING_STARTED);
    }

    // All block of uf2 file is complete --> complete DFU process
    if (_wr_state.numWritten >= _wr_state.numBlocks)
    {
      dfu_update_status_t update_status;
      memset(&update_status, 0, sizeof(dfu_update_status_t ));

      if ( _wr_state.update_bootloader )
      {
        // update bootloader always end with reset
        update_status.status_code = DFU_RESET;

        // Location of current stored new bootloader
        uint32_t * new_bootloader = (uint32_t *) BOOTLOADER_ADDR_NEW_RECIEVED;

        PRINT_HEX(new_bootloader);

        // skip if there is no bootloader change
        if ( memcmp(new_bootloader, (uint8_t*) BOOTLOADER_ADDR_START, DFU_BL_IMAGE_MAX_SIZE) )
        {
          PRINTF("Coyping new bootloader\r\n");

          sd_mbr_command_t command =
          {
            .command = SD_MBR_COMMAND_COPY_BL,
            .params.copy_bl.bl_src = new_bootloader,
            .params.copy_bl.bl_len = DFU_BL_IMAGE_MAX_SIZE/4 // size in words
          };

          // on success, COPY_BL won't return but run the new bootloader right away.
          sd_mbr_command(&command);
        }

        PRINTF("bootloader update complete\r\n");
      }else
      {
        // update App
        update_status.status_code = DFU_UPDATE_APP_COMPLETE;

        // Record the real app span so bootloader_settings.bank_0_size
        // reflects the actual app, not 0 -- ghostfat.c's CURRENT.UF2 uses
        // this to size its dump. Measured from DFU_BANK_0_REGION_START like
        // serial/OTA DFU do, so a CURRENT.UF2 restore (which also carries
        // the SoftDevice blocks) does not overcount.
        if ( _wr_state.appEnd > DFU_BANK_0_REGION_START )
        {
          update_status.app_size = _wr_state.appEnd - DFU_BANK_0_REGION_START;
        }

        PRINTF("Application update complete\r\n");
      }

      bootloader_dfu_update_process(update_status);

      led_state(STATE_WRITING_FINISHED);
    }
  }
}

// Invoked when received SCSI_CMD_READ_CAPACITY_10 and SCSI_CMD_READ_FORMAT_CAPACITY to determine the disk size
// Application update block count and block size
void tud_msc_capacity_cb(uint8_t lun, uint32_t* block_count, uint16_t* block_size)
{
  (void) lun;

  *block_count = CFG_UF2_NUM_BLOCKS;
  *block_size  = 512;
}

// Invoked when received Start Stop Unit command
// - Start = 0 : stopped power mode, if load_eject = 1 : unload disk storage
// - Start = 1 : active mode, if load_eject = 1 : load disk storage
bool tud_msc_start_stop_cb(uint8_t lun, uint8_t power_condition, bool start, bool load_eject)
{
  (void) lun;
  (void) power_condition;

  if ( load_eject )
  {
    if (start)
    {
      // load disk storage
    }else
    {
      // unload disk storage: the host ejected us. If a factory erase is
      // waiting on its timer, this is the clean moment to go.
      if ( _factory_erase_done )
      {
        app_timer_stop(_factory_erase_timer);
        factory_erase_reset_now();
      }
    }
  }

  return true;
}

#endif
